In [1]:
# Imports

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os, json, math, time
from tqdm.notebook import tqdm_notebook
import tmdbsimple as tmdb

from sqlalchemy import *
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

pd.set_option('display.max_columns', 500)

In [2]:
# Load in Data
tmdb_results = pd.read_csv("Data/tmdb_results_combined.csv.gz")
ratings = pd.read_csv("Data/title_ratings.csv.gz")
basics = pd.read_csv("Data/title_basics.csv.gz")

In [3]:
tmdb_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2600 non-null   object
 1   adult                  2598 non-null   float64
 2   backdrop_path          1437 non-null   object
 3   belongs_to_collection  211 non-null    object
 4   budget                 2598 non-null   float64
 5   genres                 2598 non-null   object
 6   homepage               170 non-null    object
 7   id                     2598 non-null   float64
 8   original_language      2598 non-null   object
 9   original_title         2598 non-null   object
 10  overview               2555 non-null   object
 11  popularity             2598 non-null   float64
 12  poster_path            2355 non-null   object
 13  production_companies   2598 non-null   object
 14  production_countries   2598 non-null   object
 15  release_date           2578 non-null   object
 16  revenue                2598 non-null   float64
 17  runtime                2598 non-null   float64
 18  spoken_languages       2598 non-null   object
 19  status                 2598 non-null   object
 20  tagline                1117 non-null   object
 21  title                  2598 non-null   object
 22  video                  2598 non-null   float64
 23  vote_average           2598 non-null   float64
 24  vote_count             2598 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 528.2+ KB

In [4]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504589 entries, 0 to 504588
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         504589 non-null  object
 1   averageRating  504589 non-null  float64
 2   numVotes       504589 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [5]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81965 entries, 0 to 81964
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81965 non-null  object
 1   titleType       81965 non-null  object
 2   primaryTitle    81965 non-null  object
 3   originalTitle   81965 non-null  object
 4   isAdult         81965 non-null  int64
 5   startYear       81965 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81965 non-null  int64
 8   genres          81965 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.6+ MB

# Normalize Generes column

## 1. Getting a List of Unique Genres

In [6]:
# Create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
81960,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
81961,tt9915872,movie,The Last White Witch,Boku no kanojo wa mahoutsukai,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81962,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
81963,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81964,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [7]:
# Separate the list of genres into new rows: one row for each genre a movie belonged to
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81963,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81963,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81963,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81964,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81964,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [8]:
# Get the unique genres from the genres_split column
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## 2. Create a new title_genres table

In [9]:
# Create a new title_genres from the exploded basics dataframe
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0068865        Drama
...          ...          ...
81963  tt9916190       Action
81963  tt9916190    Adventure
81963  tt9916190     Thriller
81964  tt9916362        Drama
81964  tt9916362      History

[153716 rows x 2 columns]

## 3. Create a genre mapper dictionary to replace string genres with integers

In [10]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

## 4. Replace the string genres in title_genres with the new integer ids

In [11]:
# Make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [12]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

## 5. Convert the genre map dictionary into a dataframe

In [13]:
genre_df = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_df

    genre_name  genre_id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

# Create SQL Movies Database

In [14]:
# Obtain the MySQL login username and password
with open('C:/Users/Justice/.secret/mysql.json') as f:
    login = json.load(f)
# Display the MySQL login keys
login.keys()

dict_keys(['user', 'password'])

In [15]:
# Create a connection
database_name = "Movies"
connection_str = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/{database_name}"

In [16]:
# Create the engine
engine = create_engine(connection_str)

In [17]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

# Create Tables

## basics table

In [18]:
# Display basics dataframe
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [19]:
# Display basics dataframe info
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81965 entries, 0 to 81964
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81965 non-null  object
 1   titleType       81965 non-null  object
 2   primaryTitle    81965 non-null  object
 3   originalTitle   81965 non-null  object
 4   isAdult         81965 non-null  int64
 5   startYear       81965 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81965 non-null  int64
 8   genres          81965 non-null  object
 9   genres_split    81965 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 6.3+ MB

In [20]:
# Drop unwanted columns
basics = basics.drop(columns=['originalTitle', 'isAdult', 'titleType',
                              'endYear', 'genres','genres_split'])

In [21]:
# Display basics dataframe info to see left over columns
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81965 entries, 0 to 81964
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81965 non-null  object
 1   primaryTitle    81965 non-null  object
 2   startYear       81965 non-null  float64
 3   runtimeMinutes  81965 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.5+ MB

In [22]:
# Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [23]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
basics.to_sql('basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

81965

In [24]:
# Set desired column as primary key
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')

In [25]:


# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM basics LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0088751,The Naked Monster,2005.0,100

## ratings table

In [26]:
# Display ratings dataframe
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000005            6.2      2635
3  tt0000006            5.1       182
4  tt0000007            5.4       825

In [27]:
# Display ratings dataframe info
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504589 entries, 0 to 504588
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         504589 non-null  object
 1   averageRating  504589 non-null  float64
 2   numVotes       504589 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [28]:
# Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema_r = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [29]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
ratings.to_sql('ratings',
              engine, 
              dtype=df_schema_r,
              if_exists='replace',
              index=False)

504589

In [30]:
# Set desired column as primary key
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

In [31]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000005            6.2      2635
3  tt0000006            5.1       182
4  tt0000007            5.4       825

## tmdb table

In [32]:
tmdb_results.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,When her scientist ex-boyfriend discovers a po...,16.734,/mUvikzKJJSg9khrVdxK8kg3TMHA.jpg,"[{'id': 85, 'logo_path': None, 'name': 'Konrad...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-12-25,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.331,1213.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,An elite Federal force whose objective is to e...,0.600,/u0njmfXD3dXxQfeykBHBuFQOYqD.jpg,[],[],2001-01-01,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,With the future of the world hanging in the ba...,1.666,/z18E0lukzOtAALmfINSTCUU0Als.jpg,"[{'id': 71364, 'logo_path': None, 'name': 'Car...","[{'iso_3166_1': 'US', 'name': 'United States o...",1996-01-01,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,"A young woman is catapulted into pop stardom, ...",8.946,/b8gKsXB6d60SC2HKUcAAzTacn0S.jpg,"[{'id': 89627, 'logo_path': None, 'name': 'Gli...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-09-21,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.438,129.0,PG-13

In [33]:
tmdb_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2600 non-null   object
 1   adult                  2598 non-null   float64
 2   backdrop_path          1437 non-null   object
 3   belongs_to_collection  211 non-null    object
 4   budget                 2598 non-null   float64
 5   genres                 2598 non-null   object
 6   homepage               170 non-null    object
 7   id                     2598 non-null   float64
 8   original_language      2598 non-null   object
 9   original_title         2598 non-null   object
 10  overview               2555 non-null   object
 11  popularity             2598 non-null   float64
 12  poster_path            2355 non-null   object
 13  production_companies   2598 non-null   object
 14  production_countries   2598 non-null   object
 15  release_date           2578 non-null   object
 16  revenue                2598 non-null   float64
 17  runtime                2598 non-null   float64
 18  spoken_languages       2598 non-null   object
 19  status                 2598 non-null   object
 20  tagline                1117 non-null   object
 21  title                  2598 non-null   object
 22  video                  2598 non-null   float64
 23  vote_average           2598 non-null   float64
 24  vote_count             2598 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 528.2+ KB

In [34]:
# Select wanted columns
tmdb = tmdb_results.loc[:, ['imdb_id', 'budget', 'revenue', 'certification']]

In [35]:
tmdb.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271666.0         PG-13

In [36]:
tmdb.drop(0, inplace=True, axis=0)

In [37]:
tmdb.head()

     imdb_id      budget     revenue certification
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271666.0         PG-13
5  tt0118652   1000000.0         0.0             R

In [38]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2599 entries, 1 to 2599
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2599 non-null   object
 1   budget         2598 non-null   float64
 2   revenue        2598 non-null   float64
 3   certification  813 non-null    object
dtypes: float64(2), object(2)
memory usage: 81.3+ KB

In [39]:
# Calculate max string lengths for object columns
imdb_id_len = tmdb['imdb_id'].fillna('').map(len).max()
certification_len = tmdb['certification'].fillna('').map(len).max()


# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema_imdb = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(),
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [40]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
tmdb.to_sql('tmdb',
              engine, 
              dtype=df_schema_imdb,
              if_exists='replace',
              index=False)

2599

In [41]:
# Set desired column as primary key
engine.execute('ALTER TABLE tmdb ADD PRIMARY KEY (`imdb_id`);')

In [42]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM tmdb LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0113026  10000000.0         0.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

## title_genres table

In [43]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [44]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153716 entries, 0 to 81964
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153716 non-null  object
 1   genre_id  153716 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [45]:
# Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema_title_genres = {
    "tconst": String(tconst_len+1), 
    'genre_id':Integer()}

In [46]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_genres.to_sql('title_genres',
              engine, 
              dtype=df_schema_title_genres,
              if_exists='replace',
              index=False)

153716

In [47]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

## genres_df table

In [48]:
genre_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [49]:
genre_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [50]:
# Calculate max string lengths for object columns
genre_name_len = genre_df['genre_name'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema_genre_df = {
    "genre_id": Integer(), 
    'genre_name': String(genre_name_len+1)}

In [51]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
genre_df.to_sql('genres',
              engine, 
              dtype=df_schema_genre_df,
              if_exists='replace',
              index=False)

25

In [52]:
# Set desired column as primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [53]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# List all Created Tables

In [54]:
# Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres
4             tmdb